MODUL7/app/Controllers/Buku.php

    public function index(){
        $session = session();
        $bukuModel = new BukuModel();
        $search = $this->request->getGet('search');
        $sort = $this->request->getGet('sort');
        $sort_order = $this->request->getVar('sort_order');
        $query = $bukuModel;
        if ($search) {
            $query = $query->like('judul', $search)
                ->orLike('penulis', $search)
                ->orLike('penerbit', $search)
                ->orLike('tahun_terbit', $search);
        }
        if ($sort && in_array($sort, ['judul', 'penulis', 'penerbit', 'tahun_terbit'])) {
            $bukuModel->orderBy($sort, $sort_order ? $sort_order : 'ASC');
        }
        $data['buku'] = $query->findAll();
---
SELECT *
FROM `buku`

                'penerbit' => $this->request->getPost('penerbit'),
                'tahun_terbit' => $this->request->getPost('tahun_terbit'),
            ];
            $bukuModel->save($data);
---
INSERT INTO `buku` (`judul`, `penulis`, `penerbit`, `tahun_terbit`) VALUES ('Funiculi Funicula', 'Toshikazu Kawaguchi', 'Gramedia Pustaka Utama', '2021')

    public function edit($id){
        $bukuModel = new BukuModel();
        $data['book'] = $bukuModel->find($id);
---
SELECT *
FROM `buku`
WHERE `buku`.`id` = '6'

                'penerbit' => $this->request->getPost('penerbit'),
                'tahun_terbit' => $this->request->getPost('tahun_terbit'),
            ];
            $bukuModel->update($id, $data);
---
UPDATE `buku` SET `judul` = 'Teman Tapi Menikah', `penulis` = 'Ayudia Bing Slamet dan Ditto Percussion', `penerbit` = 'Elex Media Komputindo', `tahun_terbit` = '2017'
WHERE `buku`.`id` IN ('6')

    public function delete($id)
    {
        $bukuModel = new BukuModel();
        $bukuModel->delete($id);
---
DELETE FROM `buku`
WHERE `id` IN ('1')